Revit 2023 API
FabricSheet.IsSolidInView Method
 Checks if this fabric sheet is shown solidly in a 3D view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2021
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The FabricSheet will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Fabric Reinforcement category.")]
public bool IsSolidInView(
	View3D view
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The FabricSheet will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Fabric Reinforcement category.")> _
Public Function IsSolidInView ( _
	view As View3D _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The FabricSheet will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Fabric Reinforcement category.")]
public:
bool IsSolidInView(
	View3D^ view
)
Parameters
view
Type: Autodesk.Revit.DB.View3D
 The 3D view element
Return Value
 True if fabric sheet is shown solidly, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InapplicableDataException |  This fabric sheet doesn't have valid visibility data.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace